# 要聚合的数据

我们首先创建一个数据框：

In [187]:
orders = [
    (9423517, '2022-02-04', 9001),
    (4626232, '2022-02-04', 9003),
    (9423534, '2022-02-04', 9001),
    (9423679, '2022-02-05', 9002),
    (4626377, '2022-02-05', 9003),
    (4626412, '2022-02-05', 9004),
    (9423783, '2022-02-06', 9002),
    (4626490, '2022-02-06', 9004)
]

导入pandas库，并且将列表转换为数据框：

In [188]:
import pandas as pd
df_orders = pd.DataFrame(orders, columns = ['OrderNo', 'Date', 'Empno'])

订单详细信息可以存储在另一个数据容器中。

In [189]:
details = [
    (9423517, 'Jeans', 'Rip Curl', 87.0, 1),
    (9423517, 'Jacknet', 'The North Face', 112.0, 1),
    (4626232, 'Socks', 'Vans', 15.0, 1),
    (4626232, 'Jeans', 'Quiksilver', 82.0, 1),
    (9423534, 'Socks', 'Dc', 10.0, 2),
    (9423534, 'Socks', 'Quiksilver', 12.0, 2),
    (9423679, 'T-shirt', 'Patagonia', 35.0, 1),
    (4626377, 'Hoody', 'Animal', 44.0, 1),
    (4626377, 'Cargo Shorts','Animal', 38.0, 1),
    (4626412, 'Shirt', 'Volcom', 78.0, 1),
    (9423783, 'Boxer Shorts', 'Superdry', 30.0, 2),
    (9423783, 'Shorts', 'Globe', 26.0, 1),
    (4626490, 'Cargo Shorts', 'Billabong', 54.0, 1),
    (4626490, 'Sweater', 'Dickies', 56.0, 1)
]

# converting the list into a DataFrame
df_details = pd.DataFrame(details, columns = ['OrderNo', 'Item', 'Brand', 'Price', 'Quantity'])

从另外一个名为emps的元组列表创建第3个数据框，存储有关公司员工的信息，其中包含员工编号，姓名和位置：

In [190]:
emps = [
    (9001, 'Jeff Russell', 'LA'),
    (9002, 'Jane Boorman', 'San Francisco'),
    (9003, 'Tom Heints', 'NYC'),
    (9004, 'Maya Silver', 'Philadelphia')
]

df_emps = pd.DataFrame(emps, columns = ['Empno', 'Empname', 'Location'])

最后，在一个名为locations的元组列表中列出每个仓库所在的城市和地区：

In [191]:
locations = [
    ('LA', 'West'),
    ('San Francisco', 'West'),
    ('NYC', 'East'),
    ('Philadelphia', 'East')
]

df_locations = pd.DataFrame(locations, columns = ['Location', 'Region'])

# 合并数据框

通常来讲，我们需要从不同的容器中收集数据，然后聚合数据。

In [192]:
df_sales = df_orders.merge(df_details)

In [193]:
print(df_sales)

    OrderNo        Date  Empno          Item           Brand  Price  Quantity
0   9423517  2022-02-04   9001         Jeans        Rip Curl   87.0         1
1   9423517  2022-02-04   9001       Jacknet  The North Face  112.0         1
2   4626232  2022-02-04   9003         Socks            Vans   15.0         1
3   4626232  2022-02-04   9003         Jeans      Quiksilver   82.0         1
4   9423534  2022-02-04   9001         Socks              Dc   10.0         2
5   9423534  2022-02-04   9001         Socks      Quiksilver   12.0         2
6   9423679  2022-02-05   9002       T-shirt       Patagonia   35.0         1
7   4626377  2022-02-05   9003         Hoody          Animal   44.0         1
8   4626377  2022-02-05   9003  Cargo Shorts          Animal   38.0         1
9   4626412  2022-02-05   9004         Shirt          Volcom   78.0         1
10  9423783  2022-02-06   9002  Boxer Shorts        Superdry   30.0         2
11  9423783  2022-02-06   9002        Shorts           Globe   26.0         1
12  4626490  2022-02-06   9004  Cargo Shorts       Billabong   54.0         1
13  4626490  2022-02-06   9004       Sweater         Dickies   56.0         1

从Quantity列可以看到，单笔订单中的商品销售量可能大于1。因此，需要将价格和销售量相乘以计算每笔订单的销售额。将价格和销售量相乘的结果存储在数据框的新字段Total中：

In [194]:
df_sales['Total'] = df_sales['Price'] * df_sales['Quantity']

这将为数据框添加Total列，现在，删除按地区和日期计算销售额时不需要的列。也就是说，在此阶段，只需要保留Date列，Total列和Empno列。

将列名列表传递给数据框，使用操作符[]可以保留仅需的数据框：

In [195]:
df_sales = df_sales[['Date', 'Empno','Total']]

In [196]:
print(df_sales)

          Date  Empno  Total
0   2022-02-04   9001   87.0
1   2022-02-04   9001  112.0
2   2022-02-04   9003   15.0
3   2022-02-04   9003   82.0
4   2022-02-04   9001   20.0
5   2022-02-04   9001   24.0
6   2022-02-05   9002   35.0
7   2022-02-05   9003   44.0
8   2022-02-05   9003   38.0
9   2022-02-05   9004   78.0
10  2022-02-06   9002   60.0
11  2022-02-06   9002   26.0
12  2022-02-06   9004   54.0
13  2022-02-06   9004   56.0

In [197]:
df_sales_emps = df_sales.merge(df_emps)
df_result = df_sales_emps.merge(df_locations)

In [198]:
print(df_sales_emps)

          Date  Empno  Total       Empname       Location
0   2022-02-04   9001   87.0  Jeff Russell             LA
1   2022-02-04   9001  112.0  Jeff Russell             LA
2   2022-02-04   9001   20.0  Jeff Russell             LA
3   2022-02-04   9001   24.0  Jeff Russell             LA
4   2022-02-04   9003   15.0    Tom Heints            NYC
5   2022-02-04   9003   82.0    Tom Heints            NYC
6   2022-02-05   9003   44.0    Tom Heints            NYC
7   2022-02-05   9003   38.0    Tom Heints            NYC
8   2022-02-05   9002   35.0  Jane Boorman  San Francisco
9   2022-02-06   9002   60.0  Jane Boorman  San Francisco
10  2022-02-06   9002   26.0  Jane Boorman  San Francisco
11  2022-02-05   9004   78.0   Maya Silver   Philadelphia
12  2022-02-06   9004   54.0   Maya Silver   Philadelphia
13  2022-02-06   9004   56.0   Maya Silver   Philadelphia

In [199]:
print(df_result)

          Date  Empno  Total       Empname       Location Region
0   2022-02-04   9001   87.0  Jeff Russell             LA   West
1   2022-02-04   9001  112.0  Jeff Russell             LA   West
2   2022-02-04   9001   20.0  Jeff Russell             LA   West
3   2022-02-04   9001   24.0  Jeff Russell             LA   West
4   2022-02-04   9003   15.0    Tom Heints            NYC   East
5   2022-02-04   9003   82.0    Tom Heints            NYC   East
6   2022-02-05   9003   44.0    Tom Heints            NYC   East
7   2022-02-05   9003   38.0    Tom Heints            NYC   East
8   2022-02-05   9002   35.0  Jane Boorman  San Francisco   West
9   2022-02-06   9002   60.0  Jane Boorman  San Francisco   West
10  2022-02-06   9002   26.0  Jane Boorman  San Francisco   West
11  2022-02-05   9004   78.0   Maya Silver   Philadelphia   East
12  2022-02-06   9004   54.0   Maya Silver   Philadelphia   East
13  2022-02-06   9004   56.0   Maya Silver   Philadelphia   East

用户可能想要删除不需要的列，而只保留实际需要的列：

In [200]:
df_result = df_result[['Date', 'Region', 'Total']]

In [201]:
df_result

          Date Region  Total
0   2022-02-04   West   87.0
1   2022-02-04   West  112.0
2   2022-02-04   West   20.0
3   2022-02-04   West   24.0
4   2022-02-04   East   15.0
5   2022-02-04   East   82.0
6   2022-02-05   East   44.0
7   2022-02-05   East   38.0
8   2022-02-05   West   35.0
9   2022-02-06   West   60.0
10  2022-02-06   West   26.0
11  2022-02-05   East   78.0
12  2022-02-06   East   54.0
13  2022-02-06   East   56.0

# 分组和聚合数据

要对数据执行聚合计算，可以使用pandas的grouby()函数。

In [202]:
df_data_region = df_result.groupby(['Date', 'Region']).sum()

这段代码是使用Python的pandas库对数据进行分组和求和操作。具体解释如下：

1. `df_result`是一个pandas DataFrame对象，它包含了需要进行分组和求和的数据。
2. `groupby(['Date', 'Region'])`表示按照'Date'和'Region'两列进行分组。这意味着相同的'Date'和'Region'值将被视为同一组。
3. `sum()`函数用于对每个分组中的数据进行求和操作。默认情况下，它会对所有数值类型的列进行求和。如果某个分组中没有数值类型的列，那么该分组的结果将为NaN。
4. 最后，`df_data_region`将包含按'Date'和'Region'分组后的求和结果。

In [203]:
df_data_region

                   Total
Date       Region
2022-02-04 East     97.0
           West    243.0
2022-02-05 East    160.0
           West     35.0
2022-02-06 East    110.0
           West     86.0

Date列和Region列都是新数据框的索引列。

In [204]:
# 查看索引
print(df_data_region.index)

MultiIndex([('2022-02-04', 'East'),
            ('2022-02-04', 'West'),
            ('2022-02-05', 'East'),
            ('2022-02-05', 'West'),
            ('2022-02-06', 'East'),
            ('2022-02-06', 'West')],
           names=['Date', 'Region'])

接着我们可以来尝试访问：

In [205]:
df_data_region.loc[('2022-02-04', 'East')]

Total    97.0
Name: (2022-02-04, East), dtype: float64

我们还可以这么做：

In [206]:
df_data_region[df_data_region.index.isin([('2022-02-05', 'West')])]

                   Total
Date       Region
2022-02-05 West     35.0

这段代码是使用Pandas库中的DataFrame对象进行数据筛选的操作。

首先，`df_data_region`是一个DataFrame对象，它包含了一些数据。

接下来，`df_data_region.index.isin([('2022-02-05', 'West')])`这部分代码的作用是判断DataFrame对象的索引是否包含在给定的列表中。这里的列表只包含一个元素：`('2022-02-05', 'West')`。

最后，`df_data_region[df_data_region.index.isin([('2022-02-05', 'West')])]`这部分代码的作用是根据前面得到的布尔值（True或False）来筛选出DataFrame对象中满足条件的行。如果某个行的索引与给定的列表中的任何一个元素匹配，那么该行就会被选中；否则，该行将被忽略。

综上所述，这段代码的作用是从`df_data_region`中筛选出索引为`('2022-02-05', 'West')`的行，并将结果存储在一个新的DataFrame对象中。

`df_data_region.index.isin([('2022-02-05', 'West')])` 的返回结果是一个布尔值Series，表示DataFrame对象的索引是否包含在给定的列表中。

In [207]:
df_data_region.index.isin([('2022-02-05', 'West')])

array([False, False, False,  True, False, False])

In [208]:
df_data_region[([False, False, False,  True, False, False])]

                   Total
Date       Region
2022-02-05 West     35.0

可以传递多个值来进行查询：

In [209]:
df_data_region[df_data_region.index.isin([('2022-02-05', 'West'), ('2022-02-06', 'East')])]

                   Total
Date       Region
2022-02-05 West     35.0
2022-02-06 East    110.0

通过切片来获得一些列的值：

In [210]:
df_data_region[('2022-02-04', 'East'):('2022-02-05', 'West')]

                   Total
Date       Region
2022-02-04 East     97.0
           West    243.0
2022-02-05 East    160.0
           West     35.0

或者可以这么做：

In [211]:
df_data_region['2022-02-04':'2022-02-05']

                   Total
Date       Region
2022-02-04 East     97.0
           West    243.0
2022-02-05 East    160.0
           West     35.0

添加统计：

In [212]:
ps = df_data_region.sum(axis=0)

In [213]:
ps

Total    731.0
dtype: float64

In [214]:
ps.name = ('All', 'All')

In [215]:
ps.name

('All', 'All')

In [216]:
ps

Total    731.0
Name: (All, All), dtype: float64

In [217]:
df_data_region.loc[len(df_data_region)]=ps

In [218]:
df_data_region

                    Total
(2022-02-04, East)   97.0
(2022-02-04, West)  243.0
(2022-02-05, East)  160.0
(2022-02-05, West)   35.0
(2022-02-06, East)  110.0
(2022-02-06, West)   86.0
6                   731.0

# 选择组中的所有行

In [220]:
import pandas as pd
# 创建一个DataFrame对象
data = {'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva'],
        'Gender': ['F', 'M', 'M', 'M', 'F'],
        'Age': [25, 30, 35, 40, 45],
        'Salary': [50000, 60000, 70000, 80000, 90000]}
df = pd.DataFrame(data)
# 使用groupby()函数对数据进行分组
grouped = df.groupby('Gender')
# 选择属于某个组的所有行
male_group = grouped.get_group('M')
print(male_group)

      Name Gender  Age  Salary
1      Bob      M   30   60000
2  Charlie      M   35   70000
3    David      M   40   80000